webmail_client/app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "email", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", "2014-11-04 02:42:12.498228"], ["email", "steveono@gmail.com"], ["updated_at", "2014-11-04 02:42:12.498228"]]
SELECT  "users".* FROM "users"  WHERE "users"."email" = 'steveono@gmail.com' LIMIT 1
UPDATE "users" SET "oauthrefresh" = $1, "oauthtoken" = $2, "updated_at" = $3 WHERE "users"."id" = 1  [["oauthrefresh", nil], ["oauthtoken", "ya29.tABRJ_6W4DJiFeRFNQyh3HzsOdUR5kDd73JC3Yg7VbBUGWscEPgOFxgEfSCpV9B_zZlVFRn8-BIRJg"], ["updated_at", "2014-11-04 02:55:45.401240"]]
---
  def callback
    #Gets the Access Token for the User Signed In and Stores it
    access_token = client.auth_code.get_token(params[:code], :redirect_uri => 'http://localhost:3000/callback')
    #Stores all the Information that Google Sends Back In Variable For Later Use
    google_profile = access_token.get('https://www.googleapis.com/oauth2/v1/userinfo?alt=json')
    google_gmail = access_token.get
    #Gets the Info Specifically About the signed in User
    user_info = JSON.parse(google_profile.body)
    emails = JSON.parse(google_profile.body)
    #Using the Information Google Sent Back Look for or create the User
    @user = User.find_or_create_by(email: user_info["email"])
    @user.update(name: user_info["name"] , email: user_info["email"], photo: user_info["picture"], oauthtoken: access_token.token, oauthrefresh: access_token.refresh_token)