webmail_client/app/controllers/users_controller.rb

  def index
    if session[:user_id]
      @user = User.find(session[:user_id])
---
SELECT  "users".* FROM "users"  WHERE "users"."id" IS NULL LIMIT 1

  def create
    # auth = hash of objects returned by google
    auth = request.env["omniauth.auth"]
    # either user is found based upon the provider (in this case google_oauth2) and uid...or...they are created using a User class method
    if user = User.find_by_provider_and_uid(auth["provider"], auth["uid"])
      session[:auth] = auth
      session[:user_id] = user.id
      flash[:success] = ["You've successfully signed in!"]
      redirect_to root_path
    else
      user = User.create_with_omniauth(auth)
---
SELECT  "users".* FROM "users"  WHERE "users"."provider" = 'google_oauth2' AND "users"."uid" = '108751959776616224101' LIMIT 1
INSERT INTO "users" ("created_at", "email", "name", "photo", "provider", "uid", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"